import { MessageDTO } from '@/types/Messenger';

export default [
  {
    id: 1,
    author: 'duck',
    created: Date.parse('01.01.2011 10:10:10'),
    text: '«Подарок» (фр. Le Cadeau) — реди-мейд американского и французского художника, фотографа и кинематографиста Ман Рэя, близкого к дадаистам и сюрреалистам. ',
  },
  {
    id: 2,
    author: 'racoon',
    created: Date.parse('01.01.2011 10:11:10'),
    text: 'Создан в декабре 1921 года в Париже и является первым дадаистским произведением, сделанным им во Франции после переезда из США в том же году.',
  },
  {
    id: 3,
    author: 'racoon',
    created: Date.parse('01.01.2011 10:15:10'),
    text: 'Ауриска́льпиум обыкнове́нный[1] (лат. Auriscalpium vulgare) — вид грибов, входящий в род Аурискальпиум (Auriscalpium) семейства Аурискальпиевые (Auriscalpiaceae). Сапротрофы; растут на опавших шишках хвойных деревьев.',
  },
  {
    id: 4,
    author: 'duck',
    created: Date.parse('01.01.2011 10:16:10'),
    text: 'Вместе с Хансом (Жаном) Арпом, Максом Эрнстом, Массоном, Миро и Пикассо участвовал в коллективной выставке сюрреалистов в парижской галерее Пьер (1925). Снял несколько авангардистских фильмов (Морская звезда, по стихотворению Р.Десноса, и др.), а также снялся сам в знаменитом фильме Рене Клера «Антракт». Создал серию известнейших фотопортретов Эрика Сати, Джеймса Джойса, Гертруды Стайн, Жана Кокто, серию ню, для которой позировала молодая художница-сюрреалистка и одновременно подруга Ман Рея, Мерет Оппенгейм (1934). Вместе со своей ассистенткой Беренис Эббот открыл фотографию Эжена Атже, введя его в круг внимания сюрреалистов и более широкой публики. В 1934 году Ж. Т. Соби опубликовал альбом его фотографий, выполненных за последние 15 лет.',
  },
  {
    id: 5,
    author: 'duck',
    created: Date.parse('01.01.2011 12:16:10'),
    text: 'В 1940—1951 годах снова жил в США, преподавал живопись и фотографию. В 1946 году он женился на Жюльет Браунер с которой жил уже шесть лет. ',
  },
] as MessageDTO[];
